#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
#+PROPERTY: header-args:python :session *data*
#+PROPERTY: header-args:python+ :exports both
#+PROPERTY: header-args:python+ :tangle yes
#+PROPERTY: header-args:python+ :async yes

#+begin_src elisp :exports none
(setq-local org-image-actual-width '(1024))
(setq-local org-html-htmlize-output-type 'css)
(setq-local org-latex-listings 'minted)
#+end_src

#+RESULTS:
: minted
* Parsing
#+begin_src python
import pandas as pd
import copy
import re
from dateutil import parser
from datetime import datetime, timedelta, time
from collections import deque
from IPython.display import display
#+end_src

#+RESULTS:

#+begin_src python
FILE = 'sleep-export.csv'
KEY_SEQ = 'Id'
NUM_COLS = set(['Id', 'Hours', 'Rating', 'Framerate', 'Snore', 'Noise', 'Cycles', 'DeepSleep', 'LenAdjust'])
DATE = '%d. %m. %Y %H:%M'
GEOS = {
    'e65661c5': 'Tuymen Home',
    'e3336046': 'Saint-Petersburg Home',
    'e3336012': 'Saint-Petersburg Home'
}
with open(FILE, 'r') as f:
    lines = f.readlines()

len(lines)
#+end_src

#+RESULTS:
: 209

#+begin_src python
def get_tags(comment):
    tags = re.findall('#\S+', comment)
    for i, tag in enumerate(tags):
        comment = comment.replace(tag, '')
        tags[i] = tag[1:]
    comment = comment.strip()
    return tags, comment

def parse_event(event):
    values = event.split('-')
    return {
        'kind': values[0],
        'timestamp': int(values[1]),
        'time': datetime.utcfromtimestamp(int(values[1]) / 1000),
        'data': values[2:]
    }
    
datetime.strptime('07. 02. 2021 9:15', DATE)
#+end_src

#+RESULTS:
: datetime.datetime(2021, 2, 7, 9, 15)

#+begin_src python :display plain
from pprint import pprint

def parse_csv_dict(lines):
    keys = None
    result = []
    for line in lines:
        if line.endswith('\n'):
            line = line[:-1]
        if keys is None:
            if line.startswith(KEY_SEQ):
                keys = line.split(',')
            else:
                continue
        else:
            row = {}
            events = []
            times = {}
            data = line.split(',')
            for key, datum in zip(keys, data):
                if datum.startswith('"'):
                    datum = datum[1:-1]
                if key.startswith('"'):
                    key = key[1:-1]
                if key == 'Event':
                    events.append(parse_event(datum))
                elif re.fullmatch(r'^\d+:\d+$', key):
                    times[key] = float(datum)
                elif key == 'From' or key == 'To' or key == 'Sched':
                    row[key] = datetime.strptime(datum, DATE)
                elif key == 'Id':
                    row['Id'] = int(datum)
                elif key in NUM_COLS:
                    row[key] = float(datum)
                elif key == 'Comment':
                    tags, comment = get_tags(datum)
                    row[key] = comment
                    row['tags'] = tags
                elif key == 'Geo':
                    row[key] = GEOS.get(datum, datum)
                else:
                    row[key] = datum
            row['events'] = sorted(events, key=lambda evt: evt['timestamp'])
            row['times'] = times
            keys = None
            result.append(row)
    result = sorted(result, key=lambda datum: datum['From'])
    return result

data = parse_csv_dict(lines)
pprint(data[0])
#+end_src

#+RESULTS:
#+begin_example
  {'Comment': '',
   'Cycles': 1.0,
   'DeepSleep': 0.6956522,
   'Framerate': 10007.0,
   'From': datetime.datetime(2020, 11, 7, 0, 33),
   'Geo': '',
   'Hours': 0.39,
   'Id': 1604698391769,
   'LenAdjust': -1.0,
   'Noise': -1.0,
   'Rating': 0.0,
   'Sched': datetime.datetime(2020, 11, 19, 1, 12),
   'Snore': -1.0,
   'To': datetime.datetime(2020, 11, 7, 0, 56),
   'Tz': 'Europe/Moscow',
   'events': [{'data': [],
               'kind': 'NO_AWAKE',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 769000),
               'timestamp': 1604698391769},
              {'data': ['1.9839158E', '38'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 769000),
               'timestamp': 1604698391769},
              {'data': [],
               'kind': 'BROKEN_START',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 769000),
               'timestamp': 1604698391769},
              {'data': ['3.761582E', '37'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 770000),
               'timestamp': 1604698391770},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 771000),
               'timestamp': 1604698391771},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 772000),
               'timestamp': 1604698391772},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 773000),
               'timestamp': 1604698391773},
              {'data': [],
               'kind': 'LUX',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 12, 214000),
               'timestamp': 1604698392214},
              {'data': [],
               'kind': 'TRACKING_PAUSED',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 16, 693000),
               'timestamp': 1604698396693},
              {'data': [],
               'kind': 'BROKEN_END',
               'time': datetime.datetime(2020, 11, 6, 21, 34, 11, 769000),
               'timestamp': 1604698451769},
              {'data': [],
               'kind': 'LIGHT_START',
               'time': datetime.datetime(2020, 11, 6, 21, 34, 11, 769000),
               'timestamp': 1604698451769},
              {'data': [],
               'kind': 'TRACKING_RESUMED',
               'time': datetime.datetime(2020, 11, 6, 21, 35, 9, 442000),
               'timestamp': 1604698509442},
              {'data': [],
               'kind': 'LIGHT_END',
               'time': datetime.datetime(2020, 11, 6, 21, 39, 11, 769000),
               'timestamp': 1604698751769},
              {'data': [],
               'kind': 'DEEP_START',
               'time': datetime.datetime(2020, 11, 6, 21, 39, 11, 769000),
               'timestamp': 1604698751769},
              {'data': [],
               'kind': 'LIGHT_START',
               'time': datetime.datetime(2020, 11, 6, 21, 55, 11, 769000),
               'timestamp': 1604699711769},
              {'data': [],
               'kind': 'DEEP_END',
               'time': datetime.datetime(2020, 11, 6, 21, 55, 11, 769000),
               'timestamp': 1604699711769},
              {'data': [],
               'kind': 'DEVICE',
               'time': datetime.datetime(2020, 11, 6, 21, 56, 51, 970000),
               'timestamp': 1604699811970},
              {'data': [],
               'kind': 'TRACKING_STOPPED_BY_USER',
               'time': datetime.datetime(2020, 11, 6, 21, 56, 51, 971000),
               'timestamp': 1604699811971},
              {'data': [],
               'kind': 'LIGHT_END',
               'time': datetime.datetime(2020, 11, 6, 21, 57, 11, 769000),
               'timestamp': 1604699831769}],
   'tags': [],
   'times': {'0:34': -0.01,
             '0:35': 3.3788679,
             '0:36': 4.543605,
             '0:37': 4.2311726,
             '0:38': 1.5838166,
             '0:39': 7.727542,
             '0:40': 0.0,
             '0:41': 0.0,
             '0:42': 0.0,
             '0:43': 0.0,
             '0:44': 0.0,
             '0:45': 0.0,
             '0:46': 0.0,
             '0:47': 0.0,
             '0:48': 0.0,
             '0:49': 0.0,
             '0:50': 0.0,
             '0:51': 0.0,
             '0:52': 0.0,
             '0:53': 0.0,
             '0:54': 0.0,
             '0:55': 10.0,
             '0:56': 3.0484104}}
#+end_example

#+begin_src python
def merge_data(data):
    data = copy.deepcopy(data)
    i, k = 0, 1
    result = []
    while i < len(data) - 1:
        a = data[i]
        b = data[i+k]
        if (b['From'] - a['To']) < timedelta(seconds=60*20):
            print(i, b['From'], a['To'], b['From'] - a['To'])
            data[i] = {
                'merged': True,
                'Comment': b['Comment'],
                'Cycles': a['Cycles'] + b['Cycles'],
                'DeepSleep': (a['DeepSleep'] * a['Hours'] + b['DeepSleep'] * b['Hours']) / (a['Hours'] + b['Hours']),
                'Framerate': b['Framerate'],
                'From': a['From'],
                'Geo': b['Geo'],
                'Hours': a['Hours'] + b['Hours'],
                'Id': a['Id'],
                'LenAdjust': b['LenAdjust'],
                'Noise': max(a['Noise'], b['Noise']),
                'Rating': b['Rating'],
                'Sched': a['Sched'],
                'Snore': max(a['Snore'], b['Snore']),
                'To': b['To'],
                'Tz': b['Tz'],
                'events': sorted([*a['events'], *b['events']], key=lambda evt: evt['timestamp']),
                'tags': list(set([*a['tags'], *b['tags']])),
                'times': {**a['times'], **b['times']}
            }
            k += 1
        else:
            result.append(data[i])
            i += k
            k = 1
    return result
    
data_2 = merge_data(data)
print(len(data), len(data_2))
pprint(data_2[0])
#+end_src

#+RESULTS:
#+begin_example
  0 2020-11-07 01:04:00 2020-11-07 00:56:00 0:08:00
  3 2020-11-09 01:02:00 2020-11-09 01:02:00 0:00:00
  16 2020-11-21 05:37:00 2020-11-21 05:37:00 0:00:00
  22 2020-11-26 05:32:00 2020-11-26 05:30:00 0:02:00
  40 2020-12-13 07:59:00 2020-12-13 07:57:00 0:02:00
  72 2021-01-12 07:03:00 2021-01-12 07:02:00 0:01:00
  88 2021-01-26 07:40:00 2021-01-26 07:38:00 0:02:00
  103 95
  {'Comment': '',
   'Cycles': 7.0,
   'DeepSleep': 0.3270899009219858,
   'Framerate': 10007.0,
   'From': datetime.datetime(2020, 11, 7, 0, 33),
   'Geo': '',
   'Hours': 8.46,
   'Id': 1604698391769,
   'LenAdjust': 0.0,
   'Noise': -1.0,
   'Rating': 3.75,
   'Sched': datetime.datetime(2020, 11, 19, 1, 12),
   'Snore': -1.0,
   'To': datetime.datetime(2020, 11, 7, 9, 8),
   'Tz': 'Europe/Moscow',
   'events': [{'data': [],
               'kind': 'NO_AWAKE',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 769000),
               'timestamp': 1604698391769},
              {'data': ['1.9839158E', '38'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 769000),
               'timestamp': 1604698391769},
              {'data': [],
               'kind': 'BROKEN_START',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 769000),
               'timestamp': 1604698391769},
              {'data': ['3.761582E', '37'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 770000),
               'timestamp': 1604698391770},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 771000),
               'timestamp': 1604698391771},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 772000),
               'timestamp': 1604698391772},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 11, 773000),
               'timestamp': 1604698391773},
              {'data': [],
               'kind': 'LUX',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 12, 214000),
               'timestamp': 1604698392214},
              {'data': [],
               'kind': 'TRACKING_PAUSED',
               'time': datetime.datetime(2020, 11, 6, 21, 33, 16, 693000),
               'timestamp': 1604698396693},
              {'data': [],
               'kind': 'BROKEN_END',
               'time': datetime.datetime(2020, 11, 6, 21, 34, 11, 769000),
               'timestamp': 1604698451769},
              {'data': [],
               'kind': 'LIGHT_START',
               'time': datetime.datetime(2020, 11, 6, 21, 34, 11, 769000),
               'timestamp': 1604698451769},
              {'data': [],
               'kind': 'TRACKING_RESUMED',
               'time': datetime.datetime(2020, 11, 6, 21, 35, 9, 442000),
               'timestamp': 1604698509442},
              {'data': [],
               'kind': 'LIGHT_END',
               'time': datetime.datetime(2020, 11, 6, 21, 39, 11, 769000),
               'timestamp': 1604698751769},
              {'data': [],
               'kind': 'DEEP_START',
               'time': datetime.datetime(2020, 11, 6, 21, 39, 11, 769000),
               'timestamp': 1604698751769},
              {'data': [],
               'kind': 'LIGHT_START',
               'time': datetime.datetime(2020, 11, 6, 21, 55, 11, 769000),
               'timestamp': 1604699711769},
              {'data': [],
               'kind': 'DEEP_END',
               'time': datetime.datetime(2020, 11, 6, 21, 55, 11, 769000),
               'timestamp': 1604699711769},
              {'data': [],
               'kind': 'DEVICE',
               'time': datetime.datetime(2020, 11, 6, 21, 56, 51, 970000),
               'timestamp': 1604699811970},
              {'data': [],
               'kind': 'TRACKING_STOPPED_BY_USER',
               'time': datetime.datetime(2020, 11, 6, 21, 56, 51, 971000),
               'timestamp': 1604699811971},
              {'data': [],
               'kind': 'LIGHT_END',
               'time': datetime.datetime(2020, 11, 6, 21, 57, 11, 769000),
               'timestamp': 1604699831769},
              {'data': ['1.298296E34'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 220000),
               'timestamp': 1604700286220},
              {'data': [],
               'kind': 'LIGHT_START',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 220000),
               'timestamp': 1604700286220},
              {'data': ['2.5428676E', '29'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 221000),
               'timestamp': 1604700286221},
              {'data': ['1.6755299E35'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 222000),
               'timestamp': 1604700286222},
              {'data': ['8.153052E', '10'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 223000),
               'timestamp': 1604700286223},
              {'data': ['3.229E', '42'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 224000),
               'timestamp': 1604700286224},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 225000),
               'timestamp': 1604700286225},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 226000),
               'timestamp': 1604700286226},
              {'data': ['2.682127E', '29'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 227000),
               'timestamp': 1604700286227},
              {'data': ['2.168421E', '19'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 228000),
               'timestamp': 1604700286228},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 229000),
               'timestamp': 1604700286229},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 230000),
               'timestamp': 1604700286230},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 231000),
               'timestamp': 1604700286231},
              {'data': ['1.1766782E', '38'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 232000),
               'timestamp': 1604700286232},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 233000),
               'timestamp': 1604700286233},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 234000),
               'timestamp': 1604700286234},
              {'data': ['2.3693558E', '38'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 235000),
               'timestamp': 1604700286235},
              {'data': ['1.149E', '41'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 236000),
               'timestamp': 1604700286236},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 237000),
               'timestamp': 1604700286237},
              {'data': ['5.877685E', '39'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 238000),
               'timestamp': 1604700286238},
              {'data': ['2.3509887E', '38'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 239000),
               'timestamp': 1604700286239},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 240000),
               'timestamp': 1604700286240},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 241000),
               'timestamp': 1604700286241},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 242000),
               'timestamp': 1604700286242},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 243000),
               'timestamp': 1604700286243},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 244000),
               'timestamp': 1604700286244},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 245000),
               'timestamp': 1604700286245},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 246000),
               'timestamp': 1604700286246},
              {'data': ['5.022E', '42'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 247000),
               'timestamp': 1604700286247},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 248000),
               'timestamp': 1604700286248},
              {'data': ['4.408104E', '39'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 249000),
               'timestamp': 1604700286249},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 250000),
               'timestamp': 1604700286250},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 251000),
               'timestamp': 1604700286251},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 252000),
               'timestamp': 1604700286252},
              {'data': ['3.761582E', '37'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 253000),
               'timestamp': 1604700286253},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 254000),
               'timestamp': 1604700286254},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 255000),
               'timestamp': 1604700286255},
              {'data': ['1.35E', '43'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 256000),
               'timestamp': 1604700286256},
              {'data': ['8.61E', '42'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 257000),
               'timestamp': 1604700286257},
              {'data': ['2.2959E', '41'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 258000),
               'timestamp': 1604700286258},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 259000),
               'timestamp': 1604700286259},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 260000),
               'timestamp': 1604700286260},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 261000),
               'timestamp': 1604700286261},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 262000),
               'timestamp': 1604700286262},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 263000),
               'timestamp': 1604700286263},
              {'data': ['4.5918E', '41'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 264000),
               'timestamp': 1604700286264},
              {'data': ['1.6551694E', '24'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 265000),
               'timestamp': 1604700286265},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 266000),
               'timestamp': 1604700286266},
              {'data': ['1344.25'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 267000),
               'timestamp': 1604700286267},
              {'data': ['2.2041598E', '38'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 268000),
               'timestamp': 1604700286268},
              {'data': ['1.7E', '44'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 269000),
               'timestamp': 1604700286269},
              {'data': ['1.1E', '44'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 270000),
               'timestamp': 1604700286270},
              {'data': ['1.102032E', '39'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 271000),
               'timestamp': 1604700286271},
              {'data': ['4.5E', '44'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 272000),
               'timestamp': 1604700286272},
              {'data': ['7.34684E', '40'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 273000),
               'timestamp': 1604700286273},
              {'data': ['2.0078433'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 274000),
               'timestamp': 1604700286274},
              {'data': ['3.73261E', '40'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 275000),
               'timestamp': 1604700286275},
              {'data': ['2.2959E', '41'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 276000),
               'timestamp': 1604700286276},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 277000),
               'timestamp': 1604700286277},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 278000),
               'timestamp': 1604700286278},
              {'data': ['2.155E', '42'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 279000),
               'timestamp': 1604700286279},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 280000),
               'timestamp': 1604700286280},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 281000),
               'timestamp': 1604700286281},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 282000),
               'timestamp': 1604700286282},
              {'data': ['2.603549E', '29'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 283000),
               'timestamp': 1604700286283},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 284000),
               'timestamp': 1604700286284},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 285000),
               'timestamp': 1604700286285},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 286000),
               'timestamp': 1604700286286},
              {'data': ['0.5020447'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 287000),
               'timestamp': 1604700286287},
              {'data': ['4.454023E', '39'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 288000),
               'timestamp': 1604700286288},
              {'data': ['2.2623E', '41'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 289000),
               'timestamp': 1604700286289},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 290000),
               'timestamp': 1604700286290},
              {'data': ['1.3958995E', '38'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 291000),
               'timestamp': 1604700286291},
              {'data': ['7.51E', '43'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 292000),
               'timestamp': 1604700286292},
              {'data': ['1.83671E', '40'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 293000),
               'timestamp': 1604700286293},
              {'data': ['7.175E', '43'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 294000),
               'timestamp': 1604700286294},
              {'data': ['1.435E', '42'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 295000),
               'timestamp': 1604700286295},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 296000),
               'timestamp': 1604700286296},
              {'data': ['1.102026E', '39'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 297000),
               'timestamp': 1604700286297},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 298000),
               'timestamp': 1604700286298},
              {'data': ['5.877472E', '39'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 299000),
               'timestamp': 1604700286299},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 300000),
               'timestamp': 1604700286300},
              {'data': ['3.59E', '43'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 301000),
               'timestamp': 1604700286301},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 302000),
               'timestamp': 1604700286302},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 303000),
               'timestamp': 1604700286303},
              {'data': ['4.656897E', '10'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 304000),
               'timestamp': 1604700286304},
              {'data': ['1.1755325E', '38'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 305000),
               'timestamp': 1604700286305},
              {'data': ['1.1E', '44'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 306000),
               'timestamp': 1604700286306},
              {'data': ['4.7294446E', '10'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 307000),
               'timestamp': 1604700286307},
              {'data': ['7.737286E', '38'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 308000),
               'timestamp': 1604700286308},
              {'data': [],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 309000),
               'timestamp': 1604700286309},
              {'data': ['1.1255943E', '19'],
               'kind': 'DHA',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 310000),
               'timestamp': 1604700286310},
              {'data': [],
               'kind': 'TRACKING_PAUSED',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 585000),
               'timestamp': 1604700286585},
              {'data': [],
               'kind': 'LUX',
               'time': datetime.datetime(2020, 11, 6, 22, 4, 46, 664000),
               'timestamp': 1604700286664},
              {'data': [],
               'kind': 'TRACKING_RESUMED',
               'time': datetime.datetime(2020, 11, 6, 22, 5, 16, 672000),
               'timestamp': 1604700316672},
              {'data': [],
               'kind': 'LIGHT_END',
               'time': datetime.datetime(2020, 11, 6, 23, 49, 46, 220000),
               'timestamp': 1604706586220},
              {'data': [],
               'kind': 'DEEP_START',
               'time': datetime.datetime(2020, 11, 6, 23, 49, 46, 220000),
               'timestamp': 1604706586220},
              {'data': [],
               'kind': 'LIGHT_START',
               'time': datetime.datetime(2020, 11, 7, 0, 29, 46, 220000),
               'timestamp': 1604708986220},
              {'data': [],
               'kind': 'DEEP_END',
               'time': datetime.datetime(2020, 11, 7, 0, 29, 46, 220000),
               'timestamp': 1604708986220},
              {'data': [],
               'kind': 'REM_START',
               'time': datetime.datetime(2020, 11, 7, 0, 39, 46, 220000),
               'timestamp': 1604709586220},
              {'data': [],
               'kind': 'REM_END',
               'time': datetime.datetime(2020, 11, 7, 0, 44, 46, 220000),
               'timestamp': 1604709886220},
              {'data': [],
               'kind': 'LIGHT_END',
               'time': datetime.datetime(2020, 11, 7, 0, 44, 46, 220000),
               'timestamp': 1604709886220},
              {'data': [],
               'kind': 'DEEP_START',
               'time': datetime.datetime(2020, 11, 7, 0, 44, 46, 220000),
               'timestamp': 1604709886220},
              {'data': [],
               'kind': 'LIGHT_START',
               'time': datetime.datetime(2020, 11, 7, 0, 59, 46, 220000),
               'timestamp': 1604710786220},
              {'data': [],
               'kind': 'DEEP_END',
               'time': datetime.datetime(2020, 11, 7, 0, 59, 46, 220000),
               'timestamp': 1604710786220},
              {'data': [],
               'kind': 'LIGHT_END',
               'time': datetime.datetime(2020, 11, 7, 1, 4, 46, 220000),
               'timestamp': 1604711086220},
              {'data': [],
               'kind': 'DEEP_START',
               'time': datetime.datetime(2020, 11, 7, 1, 4, 46, 220000),
               'timestamp': 1604711086220},
              {'data': [],
               'kind': 'LIGHT_START',
               'time': datetime.datetime(2020, 11, 7, 1, 19, 46, 220000),
               'timestamp': 1604711986220},
              {'data': [],
               'kind': 'DEEP_END',
               'time': datetime.datetime(2020, 11, 7, 1, 19, 46, 220000),
               'timestamp': 1604711986220},
              {'data': [],
               'kind': 'LIGHT_END',
               'time': datetime.datetime(2020, 11, 7, 1, 29, 46, 220000),
               'timestamp': 1604712586220},
              {'data': [],
               'kind': 'DEEP_START',
               'time': datetime.datetime(2020, 11, 7, 1, 29, 46, 220000),
               'timestamp': 1604712586220},
              {'data': [],
               'kind': 'LIGHT_START',
               'time': datetime.datetime(2020, 11, 7, 1, 59, 46, 220000),
               'timestamp': 1604714386220},
              {'data': [],
               'kind': 'DEEP_END',
               'time': datetime.datetime(2020, 11, 7, 1, 59, 46, 220000),
               'timestamp': 1604714386220},
              {'data': [],
               'kind': 'REM_START',
               'time': datetime.datetime(2020, 11, 7, 2, 9, 46, 220000),
               'timestamp': 1604714986220},
              {'data': [],
               'kind': 'REM_END',
               'time': datetime.datetime(2020, 11, 7, 2, 39, 46, 220000),
               'timestamp': 1604716786220},
              {'data': [],
               'kind': 'LIGHT_END',
               'time': datetime.datetime(2020, 11, 7, 3, 4, 46, 220000),
               'timestamp': 1604718286220},
              {'data': [],
               'kind': 'DEEP_START',
               'time': datetime.datetime(2020, 11, 7, 3, 4, 46, 220000),
               'timestamp': 1604718286220},
              {'data': [],
               'kind': 'LIGHT_START',
               'time': datetime.datetime(2020, 11, 7, 3, 19, 46, 220000),
               'timestamp': 1604719186220},
              {'data': [],
               'kind': 'DEEP_END',
               'time': datetime.datetime(2020, 11, 7, 3, 19, 46, 220000),
               'timestamp': 1604719186220},
              {'data': [],
               'kind': 'REM_START',
               'time': datetime.datetime(2020, 11, 7, 3, 29, 46, 220000),
               'timestamp': 1604719786220},
              {'data': [],
               'kind': 'REM_END',
               'time': datetime.datetime(2020, 11, 7, 4, 9, 46, 220000),
               'timestamp': 1604722186220},
              {'data': [],
               'kind': 'LIGHT_END',
               'time': datetime.datetime(2020, 11, 7, 4, 49, 46, 220000),
               'timestamp': 1604724586220},
              {'data': [],
               'kind': 'DEEP_START',
               'time': datetime.datetime(2020, 11, 7, 4, 49, 46, 220000),
               'timestamp': 1604724586220},
              {'data': [],
               'kind': 'LIGHT_START',
               'time': datetime.datetime(2020, 11, 7, 5, 24, 46, 220000),
               'timestamp': 1604726686220},
              {'data': [],
               'kind': 'DEEP_END',
               'time': datetime.datetime(2020, 11, 7, 5, 24, 46, 220000),
               'timestamp': 1604726686220},
              {'data': [],
               'kind': 'REM_START',
               'time': datetime.datetime(2020, 11, 7, 5, 34, 46, 220000),
               'timestamp': 1604727286220},
              {'data': [],
               'kind': 'REM_END',
               'time': datetime.datetime(2020, 11, 7, 5, 54, 46, 220000),
               'timestamp': 1604728486220},
              {'data': [],
               'kind': 'DEVICE',
               'time': datetime.datetime(2020, 11, 7, 6, 8, 47, 385000),
               'timestamp': 1604729327385},
              {'data': [],
               'kind': 'TRACKING_STOPPED_BY_USER',
               'time': datetime.datetime(2020, 11, 7, 6, 8, 47, 386000),
               'timestamp': 1604729327386},
              {'data': [],
               'kind': 'LIGHT_END',
               'time': datetime.datetime(2020, 11, 7, 6, 9, 46, 220000),
               'timestamp': 1604729386220}],
   'merged': True,
   'tags': [],
   'times': {'0:34': -0.01,
             '0:35': 3.3788679,
             '0:36': 4.543605,
             '0:37': 4.2311726,
             '0:38': 1.5838166,
             '0:39': 7.727542,
             '0:40': 0.0,
             '0:41': 0.0,
             '0:42': 0.0,
             '0:43': 0.0,
             '0:44': 0.0,
             '0:45': 0.0,
             '0:46': 0.0,
             '0:47': 0.0,
             '0:48': 0.0,
             '0:49': 0.0,
             '0:50': 0.0,
             '0:51': 0.0,
             '0:52': 0.0,
             '0:53': 0.0,
             '0:54': 0.0,
             '0:55': 10.0,
             '0:56': 3.0484104,
             '1:09': 7.4504004,
             '1:14': 6.8454933,
             '1:19': 5.1458254,
             '1:24': 5.997596,
             '1:29': 3.8529007,
             '1:34': 1.5406133,
             '1:39': 5.6786823,
             '1:44': 4.946411,
             '1:49': 4.549569,
             '1:54': 3.118929,
             '1:59': 2.483245,
             '2:04': 5.105103,
             '2:09': 5.1839757,
             '2:14': 4.164395,
             '2:19': 3.8390894,
             '2:24': 2.325992,
             '2:29': 3.2750313,
             '2:34': 5.2087936,
             '2:39': 1.6172212,
             '2:44': 2.7777047,
             '2:49': 7.2041764,
             '2:54': 2.487883,
             '2:59': 1.8156185,
             '3:04': 1.8496866,
             '3:09': 1.2376131,
             '3:14': 1.3815515,
             '3:19': 1.3848122,
             '3:24': 1.4614116,
             '3:29': 1.5501959,
             '3:34': 4.8219624,
             '3:39': 1.6003515,
             '3:44': 4.031162,
             '3:49': 1.7337495,
             '3:54': 1.4715034,
             '3:59': 1.5851953,
             '4:04': 8.579116,
             '4:09': 1.8498673,
             '4:14': 1.5881472,
             '4:19': 1.6184689,
             '4:24': 4.938683,
             '4:29': 7.8040004,
             '4:34': 2.9663541,
             '4:39': 1.3716525,
             '4:44': 1.576361,
             '4:49': 1.6403176,
             '4:54': 1.4972482,
             '4:59': 1.5785179,
             '5:04': 5.040814,
             '5:09': 6.8716483,
             '5:14': 1.2442954,
             '5:19': 10.0,
             '5:24': 9.700868,
             '5:29': 3.3058639,
             '5:34': 4.379346,
             '5:39': 5.451937,
             '5:44': 4.3401227,
             '5:49': 4.7329817,
             '5:54': 3.797499,
             '5:59': 4.402797,
             '6:04': 4.778226,
             '6:09': 2.732553,
             '6:14': 1.7060621,
             '6:19': 1.6659747,
             '6:24': 4.1577115,
             '6:29': 1.5844558,
             '6:34': 2.439047,
             '6:39': 3.6621733,
             '6:44': 4.4271536,
             '6:49': 8.80722,
             '6:54': 2.9964702,
             '6:59': 5.158864,
             '7:04': 5.1116853,
             '7:09': 10.0,
             '7:14': 3.2071843,
             '7:19': 5.537247,
             '7:24': 6.674844,
             '7:28': 9.132511,
             '7:33': 3.904614,
             '7:38': 3.2353628,
             '7:43': 7.551771,
             '7:48': 3.620718,
             '7:53': 1.8797345,
             '7:58': 2.5835066,
             '8:03': 1.7372118,
             '8:08': 3.135228,
             '8:13': 1.6379292,
             '8:18': 2.9999416,
             '8:23': 1.4568864,
             '8:28': 6.581896,
             '8:33': 4.8932037,
             '8:38': 3.7757235,
             '8:43': 6.1359386,
             '8:48': 4.840961,
             '8:53': 8.941954,
             '8:58': 6.521406,
             '9:03': 8.001038,
             '9:08': 7.162613}}
#+end_example
* Put
#+begin_src python :display plain
def get_dfs(data):
    data_main = deque()
    data_events = deque()
    data_times = deque()
    for datum in data:
        datum = {key.lower(): value for key, value in datum.items()}
        for event in datum['events']:
            data_events.append({**event, 'sleep_id': datum['id']})
        for time_, value in datum['times'].items():
            data_times.append({'time': datetime.strptime(time_, '%H:%M').time(), 'value': value, 'sleep_id': datum['id']})
        del datum['events']
        del datum['times']
        data_main.append(datum)
    df_main, df_events, df_times = pd.DataFrame(data_main), pd.DataFrame(data_events), pd.DataFrame(data_times)
    df_main['merged'] = df_main['merged'].apply(lambda d: d == True)
    df_main['cycles'] = df_main['cycles'].apply(lambda c: c if c > 0 else None)
    df_main['deepsleep'] = df_main['deepsleep'].apply(lambda d: d if d > 0 else None)
    return df_main, df_events, df_times
    
df_main, df_events, df_times = get_dfs(data_2)
display(df_main)
display(df_events)
display(df_times)
#+end_src

#+RESULTS:
:RESULTS:
#+begin_example
      merged         comment  cycles  deepsleep  framerate                from  \
  0     True                     7.0   0.327090    10007.0 2020-11-07 00:33:00   
  1    False                     8.0   0.381818    10007.0 2020-11-07 23:06:00   
  2     True  Manually added     NaN        NaN    10007.0 2020-11-08 22:55:00   
  3    False  Manually added     NaN        NaN    10007.0 2020-11-09 22:05:00   
  4    False                     6.0   0.294643    10007.0 2020-11-10 23:25:00   
  ..     ...             ...     ...        ...        ...                 ...   
  90   False                     9.0   0.424528    10007.0 2021-02-03 00:37:00   
  91   False                    11.0   0.608696    10007.0 2021-02-04 00:03:00   
  92   False                    11.0   0.508621    10007.0 2021-02-05 00:18:00   
  93   False                     1.0   0.235294    10007.0 2021-02-06 00:32:00   
  94   False  Manually added     NaN        NaN    10007.0 2021-02-06 08:20:00   

              geo  hours             id  lenadjust  noise  rating  \
  0                 8.46  1604698391769        0.0   -1.0    3.75   
  1                 9.73  1604779570033      -40.0   -1.0    2.75   
  2                10.11  1604865353875        0.0   -1.0    0.25   
  3                11.16  1604948749753        0.0   -1.0    0.00   
  4                 9.33  1605039913458       -2.0   -1.0    3.50   
  ..          ...    ...            ...        ...    ...     ...   
  90  Tuymen Home   8.82  1612294661637       -5.0   -1.0    4.25   
  91  Tuymen Home  10.64  1612379032796      -70.0   -1.0    4.50   
  92  Tuymen Home   9.66  1612466338100      -29.0   -1.0    4.50   
  93  Tuymen Home   2.80  1612553526088      -16.0   -1.0    2.25   
  94                4.83  1612588800035        0.0   -1.0    0.00   

                   sched  snore                  to                  tz    tags  
  0  2020-11-19 01:12:00   -1.0 2020-11-07 09:08:00       Europe/Moscow      []  
  1  2020-11-19 23:46:00   -1.0 2020-11-08 08:49:00       Europe/Moscow      []  
  2  2020-11-20 23:36:00   -1.0 2020-11-09 09:02:00       Europe/Moscow      []  
  3  2020-11-10 09:15:00   -1.0 2020-11-10 09:15:00       Europe/Moscow      []  
  4  2020-11-23 00:05:00   -1.0 2020-11-11 08:44:00       Europe/Moscow      []  
  ..                 ...    ...                 ...                 ...     ...  
  90 2021-02-15 01:18:00   -1.0 2021-02-03 09:26:00  Asia/Yekaterinburg  [geo1]  
  91 2021-02-15 01:18:00   -1.0 2021-02-04 10:42:00  Asia/Yekaterinburg  [geo1]  
  92 2021-02-15 01:18:00   -1.0 2021-02-05 09:58:00  Asia/Yekaterinburg  [geo1]  
  93 2021-02-18 01:12:00   -1.0 2021-02-06 03:20:00  Asia/Yekaterinburg  [geo1]  
  94 2021-02-06 13:10:00   -1.0 2021-02-06 13:10:00       Europe/Moscow      []  

  [95 rows x 17 columns]
#+end_example
#+begin_example
                  kind      timestamp                    time              data  \
  0           NO_AWAKE  1604698391769 2020-11-06 21:33:11.769                []   
  1                DHA  1604698391769 2020-11-06 21:33:11.769  [1.9839158E, 38]   
  2       BROKEN_START  1604698391769 2020-11-06 21:33:11.769                []   
  3                DHA  1604698391770 2020-11-06 21:33:11.770   [3.761582E, 37]   
  4                DHA  1604698391771 2020-11-06 21:33:11.771                []   
  ...              ...            ...                     ...               ...   
  13993  ALARM_STARTED  1612563600247 2021-02-05 22:20:00.247                []   
  13994  ALARM_DISMISS  1612563616835 2021-02-05 22:20:16.835                []   
  13995         DEVICE  1612563617035 2021-02-05 22:20:17.035                []   
  13996      LIGHT_END  1612563726088 2021-02-05 22:22:06.088                []   
  13997   ALARM_LATEST  1612584240000 2021-02-06 04:04:00.000                []   

              sleep_id  
  0      1604698391769  
  1      1604698391769  
  2      1604698391769  
  3      1604698391769  
  4      1604698391769  
  ...              ...  
  13993  1612553526088  
  13994  1612553526088  
  13995  1612553526088  
  13996  1612553526088  
  13997  1612553526088  

  [13998 rows x 5 columns]
#+end_example
#+begin_example
             time      value       sleep_id
  0      00:34:00  -0.010000  1604698391769
  1      00:35:00   3.378868  1604698391769
  2      00:36:00   4.543605  1604698391769
  3      00:37:00   4.231173  1604698391769
  4      00:38:00   1.583817  1604698391769
  ...         ...        ...            ...
  10085  01:05:00   1.418724  1612553526088
  10086  01:10:00   1.310217  1612553526088
  10087  01:15:00   5.233164  1612553526088
  10088  01:20:00  10.000000  1612553526088
  10089  13:10:00   0.000000  1612588800035

  [10090 rows x 3 columns]
#+end_example
:END:
